app/Models/VinylModel.php

public function call_vinyl($searchval,$limit,$offset)
{
  $db = \Config\Database::connect();
 // $query = $db->query("SELECT * FROM vinyl"  );
 $builder=$this->db->table("vinyl");
 $builder->select('vinyl.*,vinyllink.linkyoutube,vinyllink.linkspotify');
 $builder->join("vinyllink","vinyl.id=vinyllink.vinyl_id","left");

 if (!empty($searchval)) {
  $builder->like('vinyl_album_name', $searchval)
         ->orLike('vinyl_artist',$searchval)
         ->orLike('vinyl_type',$searchval)
         ->orLike('vinyl_release_date',$searchval)
         ->orLike('comment',$searchval);


  }
  $builder->limit($limit,$offset);

 $results = $builder->get()->getResult();
---
SELECT `vinyl`.*, `vinyllink`.`linkyoutube`, `vinyllink`.`linkspotify`
FROM `vinyl`
LEFT JOIN `vinyllink` ON `vinyl`.`id`=`vinyllink`.`vinyl_id`
WHERE `vinyl_album_name` LIKE '%pi%' ESCAPE '!'
OR  `vinyl_artist` LIKE '%pi%' ESCAPE '!'
OR  `vinyl_type` LIKE '%pi%' ESCAPE '!'
OR  `vinyl_release_date` LIKE '%pi%' ESCAPE '!'
OR  `comment` LIKE '%pi%' ESCAPE '!'
 LIMIT 10